---
title: "Week 02: SQL ‚Äì Using CASE"
author: "Eric Araujo"
format:
  html:
    code-fold: false
jupyter: python3
---

The CASE statement in SQL is a way to add conditional logic to your queries ‚Äî it‚Äôs like an IF-THEN-ELSE structure in programming languages.

## üìå Basic Syntax of CASE

```sql
CASE
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    ...
    ELSE resultN
END
```

You can use it:

* In SELECT to create computed columns.
* In ORDER BY to sort conditionally.
* In WHERE (less common, but possible).

## ‚úÖ Example 1: Using CASE in a SELECT

```sql
SELECT name,
       age,
       CASE 
           WHEN age < 18 THEN 'Minor'
           WHEN age < 65 THEN 'Adult'
           ELSE 'Senior'
       END AS age_group
FROM people;
```

This assigns a label (Minor, Adult, or Senior) based on age.

## ‚úÖ Example 2: Conditional Aggregation

```sql
SELECT 
    department,
    COUNT(*) AS total_employees,
    SUM(CASE WHEN gender = 'F' THEN 1 ELSE 0 END) AS female_employees
FROM employees
GROUP BY department;
```

This counts total and female employees per department.

## ‚úÖ Example 3: CASE in ORDER BY

```sql
SELECT name, priority
FROM tasks
ORDER BY 
    CASE priority
        WHEN 'High' THEN 1
        WHEN 'Medium' THEN 2
        ELSE 3
    END;
```

This sorts tasks by custom priority order.

## üîé Notes

* You must include END.
* CASE can be nested.
* There‚Äôs also a simple form:

```sql
CASE expression
    WHEN value1 THEN result1
    WHEN value2 THEN result2
    ELSE resultN
END
```

It compares a single expression against multiple values.

## üß™ Practice: Classify Products by Price

### ‚úÖ Table Setup

In [1]:
%%capture
%load_ext sql
%sql sqlite:///dbs/w02/products.db
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [2]:
%%sql
CREATE TABLE products (
    id INTEGER PRIMARY KEY,
    name TEXT,
    price REAL
);

INSERT INTO products (name, price) VALUES
('Pencil', 0.99),
('Notebook', 2.49),
('Backpack', 29.99),
('Laptop', 999.99),
('Water Bottle', 12.50);

 * sqlite:///dbs/w02/products.db
(sqlite3.OperationalError) table products already exists
[SQL: CREATE TABLE products (
    id INTEGER PRIMARY KEY,
    name TEXT,
    price REAL
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [3]:
%%sql
SELECT * FROM products;

 * sqlite:///dbs/w02/products.db
Done.

[(1, 'Pencil', 0.99),
 (2, 'Notebook', 2.49),
 (3, 'Backpack', 29.99),
 (4, 'Laptop', 999.99),
 (5, 'Water Bottle', 12.5)]

---

### ‚ùì Question:

Write an SQL query to return the name, price, and a new column called price_category that shows:

* 'Cheap' if price is less than 5
* 'Moderate' if price is between 5 and 100
* 'Expensive' if price is greater than 100

In [4]:
%%sql
SELECT 
    name,
    price,
    CASE 
        WHEN price < 5 THEN 'Cheap'
        WHEN price <= 100 THEN 'Moderate'
        ELSE 'Expensive'
    END AS price_category
FROM products;

 * sqlite:///dbs/w02/products.db
Done.

[('Pencil', 0.99, 'Cheap'),
 ('Notebook', 2.49, 'Cheap'),
 ('Backpack', 29.99, 'Moderate'),
 ('Laptop', 999.99, 'Expensive'),
 ('Water Bottle', 12.5, 'Moderate')]